# Operaciones

In [1]:
import numpy as np
import pandas as pd

In [2]:
diccionario1 = {'A':[11,12,13,12],'B':[15,16,18,17]}
dataframe1 = pd.DataFrame(diccionario1, index=['i1','i2','i3','i4'])
dataframe1

     A   B
i1  11  15
i2  12  16
i3  13  18
i4  12  17

In [3]:
dataframe1['A'].unique()

array([11, 12, 13])

In [4]:
dataframe1['A'].nunique()

3

In [5]:
dataframe1['A'].value_counts()

12    2
11    1
13    1
Name: A, dtype: int64

In [6]:
def multiplicar(x):
    return x*2
dataframe1

     A   B
i1  11  15
i2  12  16
i3  13  18
i4  12  17

In [7]:
dataframe1['A'].apply(multiplicar)

i1    22
i2    24
i3    26
i4    24
Name: A, dtype: int64

In [8]:
dataframe1['A'].apply(lambda x:x*2)

i1    22
i2    24
i3    26
i4    24
Name: A, dtype: int64

In [9]:
dataframe1

     A   B
i1  11  15
i2  12  16
i3  13  18
i4  12  17

In [10]:
dataframe1.drop('B',axis=1)

     A
i1  11
i2  12
i3  13
i4  12

In [11]:
dataframe1.drop('i1')

     A   B
i2  12  16
i3  13  18
i4  12  17

In [12]:
dataframe1

     A   B
i1  11  15
i2  12  16
i3  13  18
i4  12  17

In [13]:
dataframe1.columns

Index(['A', 'B'], dtype='object')

In [14]:
dataframe1.index

Index(['i1', 'i2', 'i3', 'i4'], dtype='object')

In [15]:
dataframe1.sort_values('B')

     A   B
i1  11  15
i2  12  16
i4  12  17
i3  13  18